[
    {
        "id": "51",
        "url": "https://edition.cnn.com/2023/11/14/tech/nepal-tiktok-ban-hnk-intl/index.html",
        "title": "Nepal bans TikTok because of ‘disruption’ to social harmony | CNN Business",
        "summary": "Nepal has announced a temporary ban on TikTok, citing disruption of social structures and impacts on the country's family and social harmony. The decision, supported by political parties in the country, follows similar actions taken by countries like India, which has completely banned the popular short video app. Nepal's ban comes after reports of over 1,600 TikTok-related cybercrime cases in the past four years in the country."
    },
    {
        "id": "52",
        "url": "https://edition.cnn.com/2023/11/14/tech/youtube-ai-generated-content-labels/index.html",
        "title": "YouTube to roll out labels for ‘realistic’ AI-generated content | CNN Business",
        "summary": "YouTube is updating its policy to require creators to disclose when they upload videos that contain manipulated or synthetic content generated by AI. This move aims to prevent viewer confusion and potential harm, particularly in the context of sensitive topics like elections and public health crises. YouTube's new disclosure labels will be added to the video description panels, and failure to comply may result in penalties such as content removal or suspension from the platform's Partner Program."
    },
    {
        "id": "50",
        "url": "https://edition.cnn.com/2023/11/13/tech/australia-dp-world-cyberattack-ports-intl-hnk/index.html",
        "title": "DP World cyberattack: Australian ports restart some operations | CNN Business",
        "summary": "One of Australia's largest port operators, DP World Australia, has restarted operations after a cyberattack disrupted its IT systems for three days. The company, which manages nearly 40% of Australia's goods flow, announced that some operations had resumed following successful tests of key systems. While port operations have restarted, DP World Australia cautioned that the incident is not yet resolved and temporary disruptions may continue as efforts to protect systems are ongoing.\n"
    },
    {
        "id": "47",
        "url": "https://edition.cnn.com/2023/11/11/tech/wework-adam-neumann-wildest-moments/index.html",
        "title": "The wildest moments of WeWork’s rise | CNN Business",
        "summary": "WeWork has officially filed for bankruptcy following years of unraveling. Co-founder Adam Neumann's extravagant lifestyle and questionable business decisions led to the downfall of the company, leaving investors and employees in turmoil. Amidst scandals involving drug use, lavish parties, and failed ventures like WeGrow and WeLive, WeWork's attempt to go public in 2019 ultimately revealed the company's unsustainable business model and conflicts of interest. The COVID-19 pandemic further worsened WeWork's situation as remote work became the norm and demand for office spaces decreased significantly."
    },
    {
        "id": "48",
        "url": "https://edition.cnn.com/2023/11/11/tech/ai-announcements-big-week/index.html",
        "title": "It was the most significant week in AI since the launch of ChatGPT | CNN Business",
        "summary": "OpenAI had a big week, hosting its first developer conference and unveiling updates to its AI tools, including the ability to create custom versions of its ChatGPT chatbot. The company also announced the GPT Store, where developers can showcase and sell their GPTs. Additionally, Elon Musk's AI startup xAI introduced a chatbot called Grok for users of his platform, X, and OpenAI experienced outages due to potential targeted attacks on its servers.\n\n"
    },
    {
        "id": "49",
        "url": "https://edition.cnn.com/2023/11/10/tech/ransomware-attack-industrial-and-commercial-bank-of-china-financial-sector/index.html",
        "title": "Brazen ransomware attack on US unit of Chinese banking giant has financial sector on alert | CNN Business",
        "summary": "A ransomware attack targeted the US unit of the Industrial and Commercial Bank of China, causing concern among regulators and senior officials. The attack highlighted the challenges faced by even the most well-defended sectors, such as banking, in the face of ransomware threats. ICBC Financial Services is still recovering from the attack, and it could take days before normal operations are resumed."
    },
    {
        "id": "46",
        "url": "https://edition.cnn.com/2023/11/08/tech/meta-facebook-instagram-teen-safety/index.html",
        "title": "Mark Zuckerberg ignored teen and user safety warnings from Meta executives | CNN Business",
        "summary": "Newly unsealed internal communications in a lawsuit against Meta reveal that CEO Mark Zuckerberg repeatedly ignored or overruled his top executives' suggestions to improve user well-being on Facebook and Instagram, particularly for teen users. The communications show how Zuckerberg vetoed proposals to disable Instagram's \"beauty filters\" and rejected suggestions to invest more in well-being initiatives. The disclosures highlight Zuckerberg's influence over decision-making at Meta and raise concerns about the company's prioritization of user welfare."
    },
    {
        "id": "43",
        "url": "https://edition.cnn.com/2023/11/09/tech/trevor-project-quitting-x-safety-concerns/index.html",
        "title": "A top LGBTQ+ advocacy org is quitting X over safety concerns | CNN Business",
        "summary": "The Trevor Project, a suicide prevention organization for LGBTQ+ youth, has decided to leave social media platform X due to increasing hate and vitriol targeting the LGBTQ community. The organization cited concerns about insufficient moderation capabilities on the platform. This move comes after months of concerns about hateful speech and controversial policy changes on X, owned by Elon Musk, who has faced criticism for his statements regarding gender identity issues."
    }
]