[
    {
        "id": "35",
        "url": "https://edition.cnn.com/2023/11/08/tech/meta-political-ads-ai-deepfakes/index.html",
        "title": "Facebook and Instagram will require political advertisers to disclose AI deepfakes | CNN Business",
        "summary": "Meta, the parent company of Instagram and Facebook, will require political advertisers worldwide to disclose the use of artificial intelligence in their ads, starting in 2023, as a measure to combat deepfakes and misleading content. The policy will cover any political or social issue advertisement on Facebook or Instagram that uses AI to create fabricated images, distort events, or manipulate the words and actions of individuals. This move reflects growing concerns about the potential risks AI-generated content poses to democracy and indicates a shift in Meta's stance on regulating political speech online."
    },
    {
        "id": "36",
        "url": "https://edition.cnn.com/2023/11/08/tech/with-big-new-ev-motor-investment-gm-is-shifting-away/index.html",
        "title": "With big new EV motor investment GM aims to cut reliance on China | CNN Business",
        "summary": "General Motors (GM) has partnered with Niron Magnetics, a Wisconsin start-up, to develop electric motor magnets that do not require rare Earth minerals sourced from China. Niron Magnetics utilizes patented methods to create high-performance magnets using readily accessible elements like iron and nitrogen, reducing environmental impacts and dependence on China. The technology may also make EV motors more affordable, but specific cost reductions were not disclosed. GM's investment in Niron Magnetics is part of its strategy to establish a domestic supply base for electric vehicles."
    },
    {
        "id": "37",
        "url": "https://edition.cnn.com/2023/11/07/tech/alphonzo-terrell-spill-twitter-risk-takers/index.html",
        "title": "Spill app: Elon Musk laid him off. Now he’s aiming to build a social network that’s better than X | CNN Business",
        "summary": "Alphonzo Terrell and DeVaris Brown, former Twitter employees, have launched a new social media app called Spill. The app aims to create a positive, safe, and inclusive space for Black, LGBTQ+, and other historically marginalized users. Spill has already gained momentum, with over 200,000 users signing up since its beta launch in June and securing $5 million in investment."
    },
    {
        "id": "38",
        "url": "https://edition.cnn.com/2023/11/07/tech/australia-optus-network-outage-intl-hnk/index.html",
        "title": "Optus outage nationwide affects millions of Australians, phone and internet connections still down | CNN Business",
        "summary": "Millions of Australians were left without phone or internet service as Optus, the country's second-largest telecommunications provider, experienced a nationwide outage. The outage caused disruption to payment systems, online operations, train networks, and ride-share services. Optus CEO Kelly Bayer Rosmarin confirmed that it was not a cyber attack and apologized to customers, but did not provide a reason for the outage or an estimate for when services would be restored."
    },
    {
        "id": "39",
        "url": "https://edition.cnn.com/2023/11/07/tech/meta-ignored-warnings-instagrams-harm/index.html",
        "title": "Meta ignored warnings on Instagram’s harm to teens, whistleblower says | CNN Business",
        "summary": "During a Senate hearing, a whistleblower from Meta (formerly Facebook) accused the company's top executives, including CEO Mark Zuckerberg, of ignoring warnings about the harms to teens on its platforms for years. The whistleblower, Arturo Bejar, revealed that his research showed that 25% of 13-to-15-year-olds reported receiving unwanted sexual advances on Instagram. Lawmakers criticized Meta and called for legislation to rein in the tech giant, with some accusing the company of hiding evidence and downplaying the mental health harms caused by its platforms.\n"
    },
    {
        "id": "40",
        "url": "https://edition.cnn.com/2023/11/07/tech/meta-ai-political-ads/index.html",
        "title": "Meta prohibits generative AI tools for political ads | CNN Business",
        "summary": "Meta is implementing restrictions on the use of its AI tools for political advertisers. The company aims to limit the potential risks associated with AI-generated content in advertising related to politics, elections, social issues, housing, employment, credit, health, pharmaceuticals, and financial services. The decision comes amid increasing concerns about AI-generated content misleading voters and disrupting the democratic process, with policymakers exploring ways to regulate or ban the use of AI in political ads."
    },
    {
        "id": "41",
        "url": "https://edition.cnn.com/2023/11/06/tech/epic-games-challenge-google-app-store/index.html",
        "title": "Epic Games goes to court to challenge Google’s App store practices | CNN Business",
        "summary": "Epic Games has launched a lawsuit against Google in federal court, accusing the company of maintaining an illegal monopoly in app distribution through the Google Play Store. The lawsuit focuses on Google's fees for in-app subscriptions and transactions, as well as other terms that app developers argue are anti-competitive. The legal battle follows a broader debate about the role of app store operators in fostering an open and competitive ecosystem."
    },
    {
        "id": "42",
        "url": "https://edition.cnn.com/2023/11/06/tech/openai-chatgpt-sam-altman-updates/index.html",
        "title": "OpenAI unveils its most powerful AI model and customizable GPTs | CNN Business",
        "summary": "OpenAI has announced a series of updates to its viral AI chatbot ChatGPT at its developer conference, including the ability for developers to create custom versions of the tool. It is also launching a digital store where developers can list their custom versions of ChatGPT and earn money based on usage. OpenAI CEO Sam Altman also revealed GPT-4 Turbo, the latest version of the underlying technology, which can support input equal to 300 pages of a standard book and offers improvements in privacy and copyright protection."
    }
]